app/controllers/movies_controller.rb

        @date = ""
      end
      if (@sort_type != "")
        @movies = Movie.where(@select_rating_string).order(@sort_type + " ASC")
---
SELECT "movies".* FROM "movies" WHERE (rating='G' or rating='PG' or rating='PG-13' or rating='R') ORDER BY release_date ASC